#คำนวนหาาภาษีที่ต้องจ่าย และเงินเดือนสุทธิของพนังงานแล้วแสดงผลทางหน้าจอ โดยรับค่ารหัสพนังงาน ชื่อพนักงานและเงินเดือนปกติของพนังงานทางแป้นพิมพ์ทั้งเงินเดือนสุทธิของพนักงานนั้นจะต้องหักค่าภาษีและเบี้ยประกันสังคมออกจากเงินเดือนปกติเสียก่อน โดยที่พนักงานต้องเสียภาษี 7% ของเงินเดือนปกติ และจ่ายค่าเบี้ยประกันสังคม 500 บาท

#ขอ 5 ฟังก์ชัน ดั้งนั้นต้อองหาให้ได้ 5 feture

#==============================
#     คำำนวณเงินเดือนพนักงาน 
#==============================
# ป้อนรหัสพนักงาน : <input>
# ป้อนชื่อพนักงาน : <input>
# ป้อนเงินเดือนปกติ : <input> บาท
#==============================
# ภาษีเป็นเงิน : <output> บาท (ขอทศนิยม 2 ตำแหน่ง)
# เงินเดือนสุทธิเป็นเงิน : <output> บาท (ขอทศนิยม 2 ตำแหน่ง)
#==============================
